<a href="https://colab.research.google.com/github/prince3017/test/blob/master/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Task 1

Fetch top 3 departments along with their name and average monthly salary. Below is the format of the report.

DEPT_NAME
AVG_MONTHLY_SALARY (USD)

Answer:

select d.name as "DEPT_NAME", avg(s.AMT) as "AVG_MONTHLY_SALARY (USD)" from employees as e join departments as d
on e.DEPT_ID = d.id
join salaries as s on s.EMP_ID = e.id
group by d.name
order by avg(s.amt) desc limit 3;

Task 2

With the same attachment, use each worksheet as a CSV file and write a script (Bash or Python) that generates the same report. Data is to be read from the CSV files not from a database.

In [2]:
import pandas as pd

In [4]:
departments=pd.read_csv("/Departments.csv")

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [6]:
employees=pd.read_csv("/Employees.csv")

In [5]:
salaries=pd.read_csv("/Salaries.csv")

In [10]:
df=pd.merge(departments,employees, left_on='ID',right_on='DEPT ID')

In [11]:
data= pd.merge(df,salaries,left_on="ID_y",right_on='EMP_ID')

In [12]:
data

     ID_x NAME_x  ID_y   NAME_y  DEPT ID  EMP_ID  MONTH (YYYYMM)  AMT (USD)
0       1     HR     1     Jack        1       1          202207       5000
1       1     HR     1     Jack        1       1          202208       5000
2       1     HR     2     John        1       2          202207       4000
3       1     HR     2     John        1       2          202208       4000
4       1     HR    10  Shirley        1      10          202207       4800
..    ...    ...   ...      ...      ...     ...             ...        ...
166     5  Sales    16   Howard        5      16          202305       7500
167     5  Sales    16   Howard        5      16          202306       7500
168     5  Sales    21    Bruce        5      21          202304       4800
169     5  Sales    21    Bruce        5      21          202305       4800
170     5  Sales    21    Bruce        5      21          202306       4800

[171 rows x 8 columns]

Task 3

Given below is a Bash / Python script that performs following computation on an integer input (n):
If n is less than 10: Calculate its Square
Example: 4 => 16
If n is between 10 and 20: Calculate the factorial of (n-10)
Example: 15 => 120
If n is greater than 20: Calculate the sum of all integers between 1 and (n-20)
Example: 25 => 15

The task is to identify the bugs in the script, fix them and share the new script. Only one of the two scripts required Bash or Python. Hint: You can correct the script by only changing 3-4 characters.

In [14]:
def compute(n):
    if n < 10:
        out = n ** 2
    elif n < 20:
        out = 1
        for i in range(1, n-9):
            out *= i
    else:
        lim = n - 19
        out = lim * lim
        out = out - lim
        out = out / 2
    print(out)

In [17]:
n = int(input("Enter an integer: "))
compute(n)

Enter an integer: 4
16